; ModuleID = 'nat64_kern.c'
source_filename = "nat64_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.nat64_config = type { %struct.in6_addr, i64, i64, i32, i32 }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.anon.4 = type { [1 x i32]*, %struct.in6_addr*, %struct.v6_addr_state*, [1 x i32]*, [1 x i32]* }
%struct.v6_addr_state = type { i64, i32, i32 }
%struct.anon.5 = type { [1 x i32]*, i32*, %struct.in6_addr*, [1 x i32]*, [1 x i32]* }
%struct.anon.6 = type { [11 x i32]*, [16 x i32]*, [4 x i32]*, [1 x i32]*, [1 x i32]* }
%struct.anon.7 = type { [22 x i32]*, [0 x i32]*, [4 x i32]*, [1 x i32]* }
%struct.v6_trie_key = type { %struct.bpf_lpm_trie_key, %struct.in6_addr }
%struct.bpf_lpm_trie_key = type { i32, [0 x i8] }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2, i32 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0, i32, i32 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 13, type: !295, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.0-2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !30, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "nat64_kern.c", directory: "/home/sha68/bpf-examples/nat64-bpf")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 397, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../lib/../headers/linux/bpf.h", directory: "/home/sha68/bpf-examples/nat64-bpf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "BPF_ANY", value: 0)
!10 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!11 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!12 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4033, baseType: !7, size: 32, elements: !14)
!14 = !{!15}
!15 = !DIEnumerator(name: "BPF_F_INGRESS", value: 1)
!16 = !{!17, !18, !19, !22, !23, !26, !28}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !20, line: 24, baseType: !21)
!20 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !7)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !25, line: 27, baseType: !22)
!25 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !20, line: 31, baseType: !18)
!30 = !{!0, !31, !62, !83, !93, !110, !126, !135, !142, !238, !252, !257, !262, !267, !272, !277, !282, !290}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 15, type: !33, isLocal: false, isDefinition: true)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nat64_config", file: !34, line: 6, size: 320, elements: !35)
!34 = !DIFile(filename: "./nat64.h", directory: "/home/sha68/bpf-examples/nat64-bpf")
!35 = !{!36, !58, !59, !60, !61}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "v6_prefix", scope: !33, file: !34, line: 7, baseType: !37, size: 128)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !38, line: 33, size: 128, elements: !39)
!38 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !37, file: !38, line: 40, baseType: !41, size: 128)
!41 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !37, file: !38, line: 34, size: 128, elements: !42)
!42 = !{!43, !49, !54}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !41, file: !38, line: 35, baseType: !44, size: 128)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !47)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !20, line: 21, baseType: !46)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!48}
!48 = !DISubrange(count: 16)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !41, file: !38, line: 37, baseType: !50, size: 128)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, elements: !52)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !25, line: 25, baseType: !19)
!52 = !{!53}
!53 = !DISubrange(count: 8)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !41, file: !38, line: 38, baseType: !55, size: 128)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 4)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_ns", scope: !33, file: !34, line: 8, baseType: !29, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !33, file: !34, line: 9, baseType: !29, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "v4_prefix", scope: !33, file: !34, line: 10, baseType: !22, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "v4_mask", scope: !33, file: !34, line: 11, baseType: !22, size: 32, offset: 288)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "v6_state_map", scope: !2, file: !3, line: 23, type: !64, isLocal: false, isDefinition: true)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 17, size: 320, elements: !65)
!65 = !{!66, !72, !74, !81, !82}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !3, line: 18, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 32, elements: !70)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !64, file: !3, line: 19, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !64, file: !3, line: 20, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v6_addr_state", file: !34, line: 14, size: 128, elements: !77)
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "last_seen", scope: !76, file: !34, line: 15, baseType: !29, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "v4_addr", scope: !76, file: !34, line: 16, baseType: !22, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "static_conf", scope: !76, file: !34, line: 17, baseType: !22, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !64, file: !3, line: 21, baseType: !67, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !64, file: !3, line: 22, baseType: !67, size: 64, offset: 256)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "v4_reversemap", scope: !2, file: !3, line: 31, type: !85, isLocal: false, isDefinition: true)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 25, size: 320, elements: !86)
!86 = !{!87, !88, !90, !91, !92}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !3, line: 26, baseType: !67, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !85, file: !3, line: 27, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !85, file: !3, line: 28, baseType: !73, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !85, file: !3, line: 29, baseType: !67, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !85, file: !3, line: 30, baseType: !67, size: 64, offset: 256)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "allowed_v6_src", scope: !2, file: !3, line: 39, type: !95, isLocal: false, isDefinition: true)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 33, size: 320, elements: !96)
!96 = !{!97, !102, !105, !108, !109}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !3, line: 34, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 352, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 11)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !95, file: !3, line: 35, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !47)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !95, file: !3, line: 36, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !56)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !95, file: !3, line: 37, baseType: !67, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !95, file: !3, line: 38, baseType: !67, size: 64, offset: 256)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "reclaimed_addrs", scope: !2, file: !3, line: 46, type: !112, isLocal: false, isDefinition: true)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 41, size: 256, elements: !113)
!113 = !{!114, !119, !124, !125}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !3, line: 42, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 704, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 22)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !112, file: !3, line: 43, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 0)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !112, file: !3, line: 44, baseType: !106, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !112, file: !3, line: 45, baseType: !67, size: 64, offset: 192)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !128, line: 171, type: !129, isLocal: true, isDefinition: true)
!128 = !DIFile(filename: "../lib/libbpf-install/usr/include/bpf/bpf_helper_defs.h", directory: "/home/sha68/bpf-examples/nat64-bpf")
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !133, !22, null}
!132 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !128, line: 50, type: !137, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!17, !17, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "bpf_skb_change_proto", scope: !2, file: !128, line: 850, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!132, !147, !51, !29}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !6, line: 4183, size: 1472, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !179, !180, !212, !213, !214, !215, !237}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, file: !6, line: 4184, baseType: !22, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !148, file: !6, line: 4185, baseType: !22, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !148, file: !6, line: 4186, baseType: !22, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !148, file: !6, line: 4187, baseType: !22, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !148, file: !6, line: 4188, baseType: !22, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !148, file: !6, line: 4189, baseType: !22, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !148, file: !6, line: 4190, baseType: !22, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !148, file: !6, line: 4191, baseType: !22, size: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !148, file: !6, line: 4192, baseType: !22, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !148, file: !6, line: 4193, baseType: !22, size: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !148, file: !6, line: 4194, baseType: !22, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !148, file: !6, line: 4195, baseType: !22, size: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !148, file: !6, line: 4196, baseType: !163, size: 160, offset: 384)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 5)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !148, file: !6, line: 4197, baseType: !22, size: 32, offset: 544)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !148, file: !6, line: 4198, baseType: !22, size: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !6, line: 4199, baseType: !22, size: 32, offset: 608)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !148, file: !6, line: 4200, baseType: !22, size: 32, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !148, file: !6, line: 4201, baseType: !22, size: 32, offset: 672)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !148, file: !6, line: 4204, baseType: !22, size: 32, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !148, file: !6, line: 4205, baseType: !22, size: 32, offset: 736)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !148, file: !6, line: 4206, baseType: !22, size: 32, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !148, file: !6, line: 4207, baseType: !175, size: 128, offset: 800)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !56)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !148, file: !6, line: 4208, baseType: !175, size: 128, offset: 928)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !148, file: !6, line: 4209, baseType: !22, size: 32, offset: 1056)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !148, file: !6, line: 4210, baseType: !22, size: 32, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !148, file: !6, line: 4213, baseType: !22, size: 32, offset: 1120)
!180 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !6, line: 4214, baseType: !181, size: 64, align: 64, offset: 1152)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !6, line: 4214, size: 64, align: 64, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !181, file: !6, line: 4214, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !6, line: 5041, size: 448, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !210, !211}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !185, file: !6, line: 5042, baseType: !19, size: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !185, file: !6, line: 5043, baseType: !19, size: 16, offset: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !185, file: !6, line: 5044, baseType: !19, size: 16, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !185, file: !6, line: 5045, baseType: !45, size: 8, offset: 48)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !185, file: !6, line: 5046, baseType: !45, size: 8, offset: 56)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !185, file: !6, line: 5047, baseType: !45, size: 8, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !185, file: !6, line: 5048, baseType: !45, size: 8, offset: 72)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !185, file: !6, line: 5049, baseType: !51, size: 16, offset: 80)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !185, file: !6, line: 5050, baseType: !51, size: 16, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !185, file: !6, line: 5051, baseType: !51, size: 16, offset: 112)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !6, line: 5052, baseType: !198, size: 256, offset: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !185, file: !6, line: 5052, size: 256, elements: !199)
!199 = !{!200, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !6, line: 5053, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !6, line: 5053, size: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !201, file: !6, line: 5054, baseType: !24, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !201, file: !6, line: 5055, baseType: !24, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !6, line: 5057, baseType: !206, size: 256)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !6, line: 5057, size: 256, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !206, file: !6, line: 5058, baseType: !175, size: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !206, file: !6, line: 5059, baseType: !175, size: 128, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !6, line: 5062, baseType: !22, size: 32, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !185, file: !6, line: 5063, baseType: !24, size: 32, offset: 416)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !148, file: !6, line: 4215, baseType: !29, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !148, file: !6, line: 4216, baseType: !22, size: 32, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !148, file: !6, line: 4217, baseType: !22, size: 32, offset: 1312)
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !6, line: 4218, baseType: !216, size: 64, align: 64, offset: 1344)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !6, line: 4218, size: 64, align: 64, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !216, file: !6, line: 4218, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 4272, size: 640, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !220, file: !6, line: 4273, baseType: !22, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !220, file: !6, line: 4274, baseType: !22, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !220, file: !6, line: 4275, baseType: !22, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !220, file: !6, line: 4276, baseType: !22, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !220, file: !6, line: 4277, baseType: !22, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !220, file: !6, line: 4278, baseType: !22, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !220, file: !6, line: 4280, baseType: !22, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !220, file: !6, line: 4281, baseType: !175, size: 128, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !220, file: !6, line: 4282, baseType: !22, size: 32, offset: 352)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !220, file: !6, line: 4283, baseType: !22, size: 32, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !220, file: !6, line: 4284, baseType: !22, size: 32, offset: 416)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !220, file: !6, line: 4285, baseType: !175, size: 128, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !220, file: !6, line: 4286, baseType: !22, size: 32, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !220, file: !6, line: 4287, baseType: !236, size: 32, offset: 608)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !20, line: 26, baseType: !69)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !148, file: !6, line: 4219, baseType: !22, size: 32, offset: 1408)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "bpf_redirect_neigh", scope: !2, file: !128, line: 3593, type: !240, isLocal: true, isDefinition: true)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!132, !22, !243, !69, !29}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_redir_neigh", file: !6, line: 5016, size: 160, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nh_family", scope: !244, file: !6, line: 5018, baseType: !22, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !6, line: 5020, baseType: !248, size: 128, offset: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !6, line: 5020, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_nh", scope: !248, file: !6, line: 5021, baseType: !24, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_nh", scope: !248, file: !6, line: 5022, baseType: !175, size: 128)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "bpf_map_pop_elem", scope: !2, file: !128, line: 2245, type: !254, isLocal: true, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!132, !17, !17}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "bpf_for_each_map_elem", scope: !2, file: !128, line: 3864, type: !259, isLocal: true, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!132, !17, !17, !17, !29}
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !128, line: 82, type: !264, isLocal: true, isDefinition: true)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!132, !17, !140}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "bpf_map_push_elem", scope: !2, file: !128, line: 2235, type: !269, isLocal: true, isDefinition: true)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!132, !17, !140, !29}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !128, line: 108, type: !274, isLocal: true, isDefinition: true)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!29}
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !128, line: 72, type: !279, isLocal: true, isDefinition: true)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!132, !17, !140, !140, !29}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !128, line: 783, type: !284, isLocal: true, isDefinition: true)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !23, !22, !23, !22, !289}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !20, line: 30, baseType: !288)
!288 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !25, line: 32, baseType: !22)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !128, line: 608, type: !292, isLocal: true, isDefinition: true)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!132, !22, !29}
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !56)
!296 = !{i32 7, !"Dwarf Version", i32 4}
!297 = !{i32 2, !"Debug Info Version", i32 3}
!298 = !{i32 1, !"wchar_size", i32 4}
!299 = !{i32 7, !"frame-pointer", i32 2}
!300 = !{!"Ubuntu clang version 13.0.0-2"}
!301 = distinct !DISubprogram(name: "nat64_egress", scope: !3, file: !3, line: 383, type: !302, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!69, !147}
!304 = !{!305}
!305 = !DILocalVariable(name: "skb", arg: 1, scope: !301, file: !3, line: 383, type: !147)
!306 = !DILocation(line: 0, scope: !301)
!307 = !DILocation(line: 385, column: 16, scope: !301)
!308 = !DILocation(line: 385, column: 9, scope: !301)
!309 = distinct !DISubprogram(name: "nat64_handler", scope: !3, file: !3, line: 365, type: !310, scopeLine: 366, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !313)
!310 = !DISubroutineType(types: !311)
!311 = !{!69, !147, !312}
!312 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!313 = !{!314, !315, !316, !317, !318, !323, !334}
!314 = !DILocalVariable(name: "skb", arg: 1, scope: !309, file: !3, line: 365, type: !147)
!315 = !DILocalVariable(name: "egress", arg: 2, scope: !309, file: !3, line: 365, type: !312)
!316 = !DILocalVariable(name: "data_end", scope: !309, file: !3, line: 367, type: !17)
!317 = !DILocalVariable(name: "data", scope: !309, file: !3, line: 368, type: !17)
!318 = !DILocalVariable(name: "nh", scope: !309, file: !3, line: 369, type: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !320, line: 35, size: 64, elements: !321)
!320 = !DIFile(filename: "./../include/xdp/parsing_helpers.h", directory: "/home/sha68/bpf-examples/nat64-bpf")
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !319, file: !320, line: 36, baseType: !17, size: 64)
!323 = !DILocalVariable(name: "eth", scope: !309, file: !3, line: 370, type: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !326, line: 165, size: 112, elements: !327)
!326 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!327 = !{!328, !332, !333}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !325, file: !326, line: 166, baseType: !329, size: 48)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 48, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 6)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !325, file: !326, line: 167, baseType: !329, size: 48, offset: 48)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !325, file: !326, line: 168, baseType: !51, size: 16, offset: 96)
!334 = !DILocalVariable(name: "eth_type", scope: !309, file: !3, line: 371, type: !69)
!335 = !DILocation(line: 0, scope: !309)
!336 = !DILocation(line: 367, column: 52, scope: !309)
!337 = !{!338, !339, i64 80}
!338 = !{!"__sk_buff", !339, i64 0, !339, i64 4, !339, i64 8, !339, i64 12, !339, i64 16, !339, i64 20, !339, i64 24, !339, i64 28, !339, i64 32, !339, i64 36, !339, i64 40, !339, i64 44, !340, i64 48, !339, i64 68, !339, i64 72, !339, i64 76, !339, i64 80, !339, i64 84, !339, i64 88, !339, i64 92, !339, i64 96, !340, i64 100, !340, i64 116, !339, i64 132, !339, i64 136, !339, i64 140, !340, i64 144, !342, i64 152, !339, i64 160, !339, i64 164, !340, i64 168, !339, i64 176}
!339 = !{!"int", !340, i64 0}
!340 = !{!"omnipotent char", !341, i64 0}
!341 = !{!"Simple C/C++ TBAA"}
!342 = !{!"long long", !340, i64 0}
!343 = !DILocation(line: 367, column: 27, scope: !309)
!344 = !DILocation(line: 367, column: 19, scope: !309)
!345 = !DILocation(line: 368, column: 48, scope: !309)
!346 = !{!338, !339, i64 76}
!347 = !DILocation(line: 368, column: 23, scope: !309)
!348 = !DILocation(line: 368, column: 15, scope: !309)
!349 = !DILocalVariable(name: "nh", arg: 1, scope: !350, file: !320, line: 131, type: !353)
!350 = distinct !DISubprogram(name: "parse_ethhdr", scope: !320, file: !320, line: 131, type: !351, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !355)
!351 = !DISubroutineType(types: !352)
!352 = !{!69, !353, !17, !354}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!355 = !{!349, !356, !357}
!356 = !DILocalVariable(name: "data_end", arg: 2, scope: !350, file: !320, line: 132, type: !17)
!357 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !350, file: !320, line: 133, type: !354)
!358 = !DILocation(line: 0, scope: !350, inlinedAt: !359)
!359 = distinct !DILocation(line: 374, column: 13, scope: !309)
!360 = !DILocalVariable(name: "nh", arg: 1, scope: !361, file: !320, line: 86, type: !353)
!361 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !320, file: !320, line: 86, type: !362, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !371)
!362 = !DISubroutineType(types: !363)
!363 = !{!69, !353, !17, !354, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !320, line: 71, size: 32, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !320, line: 72, baseType: !368, size: 32)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 2)
!371 = !{!360, !372, !373, !374, !375, !376, !377, !383, !384}
!372 = !DILocalVariable(name: "data_end", arg: 2, scope: !361, file: !320, line: 87, type: !17)
!373 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !361, file: !320, line: 88, type: !354)
!374 = !DILocalVariable(name: "vlans", arg: 4, scope: !361, file: !320, line: 89, type: !364)
!375 = !DILocalVariable(name: "eth", scope: !361, file: !320, line: 91, type: !324)
!376 = !DILocalVariable(name: "hdrsize", scope: !361, file: !320, line: 92, type: !69)
!377 = !DILocalVariable(name: "vlh", scope: !361, file: !320, line: 93, type: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !320, line: 44, size: 32, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !379, file: !320, line: 45, baseType: !51, size: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !379, file: !320, line: 46, baseType: !51, size: 16, offset: 16)
!383 = !DILocalVariable(name: "h_proto", scope: !361, file: !320, line: 94, type: !19)
!384 = !DILocalVariable(name: "i", scope: !361, file: !320, line: 95, type: !69)
!385 = !DILocation(line: 0, scope: !361, inlinedAt: !386)
!386 = distinct !DILocation(line: 136, column: 9, scope: !350, inlinedAt: !359)
!387 = !DILocation(line: 100, column: 14, scope: !388, inlinedAt: !386)
!388 = distinct !DILexicalBlock(scope: !361, file: !320, line: 100, column: 6)
!389 = !DILocation(line: 100, column: 24, scope: !388, inlinedAt: !386)
!390 = !DILocation(line: 100, column: 6, scope: !361, inlinedAt: !386)
!391 = !DILocation(line: 106, column: 17, scope: !361, inlinedAt: !386)
!392 = !{!393, !393, i64 0}
!393 = !{!"short", !340, i64 0}
!394 = !DILocalVariable(name: "h_proto", arg: 1, scope: !395, file: !320, line: 75, type: !19)
!395 = distinct !DISubprogram(name: "proto_is_vlan", scope: !320, file: !320, line: 75, type: !396, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{!69, !19}
!398 = !{!394}
!399 = !DILocation(line: 0, scope: !395, inlinedAt: !400)
!400 = distinct !DILocation(line: 113, column: 8, scope: !401, inlinedAt: !386)
!401 = distinct !DILexicalBlock(scope: !402, file: !320, line: 113, column: 7)
!402 = distinct !DILexicalBlock(scope: !403, file: !320, line: 112, column: 39)
!403 = distinct !DILexicalBlock(scope: !404, file: !320, line: 112, column: 2)
!404 = distinct !DILexicalBlock(scope: !361, file: !320, line: 112, column: 2)
!405 = !DILocation(line: 77, column: 20, scope: !395, inlinedAt: !400)
!406 = !DILocation(line: 77, column: 46, scope: !395, inlinedAt: !400)
!407 = !DILocation(line: 113, column: 7, scope: !402, inlinedAt: !386)
!408 = !DILocation(line: 116, column: 11, scope: !409, inlinedAt: !386)
!409 = distinct !DILexicalBlock(scope: !402, file: !320, line: 116, column: 7)
!410 = !DILocation(line: 116, column: 15, scope: !409, inlinedAt: !386)
!411 = !DILocation(line: 116, column: 7, scope: !402, inlinedAt: !386)
!412 = !DILocation(line: 119, column: 18, scope: !402, inlinedAt: !386)
!413 = !DILocation(line: 375, column: 15, scope: !414)
!414 = distinct !DILexicalBlock(scope: !309, file: !3, line: 375, column: 6)
!415 = !DILocation(line: 375, column: 38, scope: !414)
!416 = !DILocalVariable(name: "dst_hdr", scope: !417, file: !3, line: 73, type: !431)
!417 = distinct !DISubprogram(name: "nat64_handle_v4", scope: !3, file: !3, line: 60, type: !418, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{!69, !147, !353}
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !445, !446, !463, !464, !416, !465, !472, !479, !484}
!421 = !DILocalVariable(name: "skb", arg: 1, scope: !417, file: !3, line: 60, type: !147)
!422 = !DILocalVariable(name: "nh", arg: 2, scope: !417, file: !3, line: 60, type: !353)
!423 = !DILocalVariable(name: "data_end", scope: !417, file: !3, line: 62, type: !17)
!424 = !DILocalVariable(name: "data", scope: !417, file: !3, line: 63, type: !17)
!425 = !DILocalVariable(name: "ip_type", scope: !417, file: !3, line: 65, type: !69)
!426 = !DILocalVariable(name: "iphdr_len", scope: !417, file: !3, line: 65, type: !69)
!427 = !DILocalVariable(name: "ip_offset", scope: !417, file: !3, line: 65, type: !69)
!428 = !DILocalVariable(name: "dst_v6", scope: !417, file: !3, line: 66, type: !73)
!429 = !DILocalVariable(name: "ip6h", scope: !417, file: !3, line: 67, type: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !432, line: 117, size: 320, elements: !433)
!432 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!433 = !{!434, !435, !436, !440, !441, !442, !443, !444}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !431, file: !432, line: 119, baseType: !45, size: 4, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !431, file: !432, line: 120, baseType: !45, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !431, file: !432, line: 127, baseType: !437, size: 24, offset: 8)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 24, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 3)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !431, file: !432, line: 129, baseType: !51, size: 16, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !431, file: !432, line: 130, baseType: !45, size: 8, offset: 48)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !431, file: !432, line: 131, baseType: !45, size: 8, offset: 56)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !431, file: !432, line: 133, baseType: !37, size: 128, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !431, file: !432, line: 134, baseType: !37, size: 128, offset: 192)
!445 = !DILocalVariable(name: "ret", scope: !417, file: !3, line: 68, type: !69)
!446 = !DILocalVariable(name: "iph", scope: !417, file: !3, line: 69, type: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !449, line: 86, size: 160, elements: !450)
!449 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !461, !462}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !448, file: !449, line: 88, baseType: !45, size: 4, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !448, file: !449, line: 89, baseType: !45, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !448, file: !449, line: 96, baseType: !45, size: 8, offset: 8)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !448, file: !449, line: 97, baseType: !51, size: 16, offset: 16)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !448, file: !449, line: 98, baseType: !51, size: 16, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !448, file: !449, line: 99, baseType: !51, size: 16, offset: 48)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !448, file: !449, line: 100, baseType: !45, size: 8, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !448, file: !449, line: 101, baseType: !45, size: 8, offset: 72)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !448, file: !449, line: 102, baseType: !460, size: 16, offset: 80)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !25, line: 31, baseType: !19)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !448, file: !449, line: 103, baseType: !24, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !448, file: !449, line: 104, baseType: !24, size: 32, offset: 128)
!463 = !DILocalVariable(name: "eth", scope: !417, file: !3, line: 70, type: !324)
!464 = !DILocalVariable(name: "dst_v4", scope: !417, file: !3, line: 71, type: !22)
!465 = !DILocalVariable(name: "____fmt", scope: !466, file: !3, line: 104, type: !469)
!466 = distinct !DILexicalBlock(scope: !467, file: !3, line: 104, column: 17)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 103, column: 50)
!468 = distinct !DILexicalBlock(scope: !417, file: !3, line: 102, column: 13)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 608, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 76)
!472 = !DILocalVariable(name: "____fmt", scope: !473, file: !3, line: 112, type: !476)
!473 = distinct !DILexicalBlock(scope: !474, file: !3, line: 112, column: 17)
!474 = distinct !DILexicalBlock(scope: !475, file: !3, line: 111, column: 22)
!475 = distinct !DILexicalBlock(scope: !417, file: !3, line: 111, column: 13)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 336, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 42)
!479 = !DILocalVariable(name: "____fmt", scope: !480, file: !3, line: 116, type: !481)
!480 = distinct !DILexicalBlock(scope: !417, file: !3, line: 116, column: 9)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 384, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 48)
!484 = !DILabel(scope: !417, name: "out", file: !3, line: 143)
!485 = !DILocation(line: 73, column: 17, scope: !417, inlinedAt: !486)
!486 = distinct !DILocation(line: 376, column: 10, scope: !414)
!487 = !DILocation(line: 0, scope: !417, inlinedAt: !486)
!488 = !DILocation(line: 71, column: 9, scope: !417, inlinedAt: !486)
!489 = !DILocation(line: 73, column: 2, scope: !417, inlinedAt: !486)
!490 = !DILocation(line: 75, column: 19, scope: !417, inlinedAt: !486)
!491 = !{i64 0, i64 16, !492, i64 0, i64 16, !492, i64 0, i64 16, !492}
!492 = !{!340, !340, i64 0}
!493 = !DILocation(line: 78, column: 30, scope: !417, inlinedAt: !486)
!494 = !DILocation(line: 78, column: 21, scope: !417, inlinedAt: !486)
!495 = !DILocalVariable(name: "nh", arg: 1, scope: !496, file: !320, line: 196, type: !353)
!496 = distinct !DISubprogram(name: "parse_iphdr", scope: !320, file: !320, line: 196, type: !497, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !500)
!497 = !DISubroutineType(types: !498)
!498 = !{!69, !353, !17, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!500 = !{!495, !501, !502, !503, !504}
!501 = !DILocalVariable(name: "data_end", arg: 2, scope: !496, file: !320, line: 197, type: !17)
!502 = !DILocalVariable(name: "iphdr", arg: 3, scope: !496, file: !320, line: 198, type: !499)
!503 = !DILocalVariable(name: "iph", scope: !496, file: !320, line: 200, type: !447)
!504 = !DILocalVariable(name: "hdrsize", scope: !496, file: !320, line: 201, type: !69)
!505 = !DILocation(line: 0, scope: !496, inlinedAt: !506)
!506 = distinct !DILocation(line: 80, column: 19, scope: !417, inlinedAt: !486)
!507 = !DILocation(line: 203, column: 10, scope: !508, inlinedAt: !506)
!508 = distinct !DILexicalBlock(scope: !496, file: !320, line: 203, column: 6)
!509 = !DILocation(line: 203, column: 14, scope: !508, inlinedAt: !506)
!510 = !DILocation(line: 203, column: 6, scope: !496, inlinedAt: !506)
!511 = !DILocation(line: 206, column: 11, scope: !512, inlinedAt: !506)
!512 = distinct !DILexicalBlock(scope: !496, file: !320, line: 206, column: 6)
!513 = !DILocation(line: 206, column: 19, scope: !512, inlinedAt: !506)
!514 = !DILocation(line: 206, column: 6, scope: !496, inlinedAt: !506)
!515 = !DILocation(line: 209, column: 21, scope: !496, inlinedAt: !506)
!516 = !DILocation(line: 211, column: 13, scope: !517, inlinedAt: !506)
!517 = distinct !DILexicalBlock(scope: !496, file: !320, line: 211, column: 5)
!518 = !DILocation(line: 211, column: 5, scope: !496, inlinedAt: !506)
!519 = !DILocation(line: 215, column: 14, scope: !520, inlinedAt: !506)
!520 = distinct !DILexicalBlock(scope: !496, file: !320, line: 215, column: 6)
!521 = !DILocation(line: 215, column: 24, scope: !520, inlinedAt: !506)
!522 = !DILocation(line: 215, column: 6, scope: !496, inlinedAt: !506)
!523 = !DILocation(line: 84, column: 18, scope: !417, inlinedAt: !486)
!524 = !{!525, !339, i64 16}
!525 = !{!"iphdr", !340, i64 0, !340, i64 0, !340, i64 1, !393, i64 2, !393, i64 4, !393, i64 6, !340, i64 8, !340, i64 9, !393, i64 10, !339, i64 12, !339, i64 16}
!526 = !DILocation(line: 84, column: 16, scope: !417, inlinedAt: !486)
!527 = !{!339, !339, i64 0}
!528 = !DILocation(line: 85, column: 30, scope: !529, inlinedAt: !486)
!529 = distinct !DILexicalBlock(scope: !417, file: !3, line: 85, column: 13)
!530 = !{!531, !339, i64 36}
!531 = !{!"nat64_config", !532, i64 0, !342, i64 16, !342, i64 24, !339, i64 32, !339, i64 36}
!532 = !{!"in6_addr", !340, i64 0}
!533 = !DILocation(line: 85, column: 21, scope: !529, inlinedAt: !486)
!534 = !DILocation(line: 85, column: 49, scope: !529, inlinedAt: !486)
!535 = !{!531, !339, i64 32}
!536 = !DILocation(line: 85, column: 39, scope: !529, inlinedAt: !486)
!537 = !DILocation(line: 85, column: 13, scope: !417, inlinedAt: !486)
!538 = !DILocation(line: 101, column: 26, scope: !417, inlinedAt: !486)
!539 = !DILocation(line: 102, column: 23, scope: !468, inlinedAt: !486)
!540 = !DILocation(line: 102, column: 47, scope: !468, inlinedAt: !486)
!541 = !DILocation(line: 103, column: 19, scope: !468, inlinedAt: !486)
!542 = !{!525, !393, i64 6}
!543 = !DILocation(line: 103, column: 28, scope: !468, inlinedAt: !486)
!544 = !DILocation(line: 102, column: 13, scope: !417, inlinedAt: !486)
!545 = !DILocation(line: 104, column: 17, scope: !466, inlinedAt: !486)
!546 = !DILocation(line: 104, column: 17, scope: !467, inlinedAt: !486)
!547 = !DILocation(line: 106, column: 17, scope: !467, inlinedAt: !486)
!548 = !DILocation(line: 110, column: 18, scope: !417, inlinedAt: !486)
!549 = !DILocation(line: 111, column: 14, scope: !475, inlinedAt: !486)
!550 = !DILocation(line: 111, column: 13, scope: !417, inlinedAt: !486)
!551 = !DILocation(line: 112, column: 17, scope: !473, inlinedAt: !486)
!552 = !DILocation(line: 112, column: 17, scope: !474, inlinedAt: !486)
!553 = !DILocation(line: 113, column: 17, scope: !474, inlinedAt: !486)
!554 = !DILocation(line: 116, column: 9, scope: !480, inlinedAt: !486)
!555 = !DILocation(line: 116, column: 9, scope: !417, inlinedAt: !486)
!556 = !DILocation(line: 119, column: 43, scope: !417, inlinedAt: !486)
!557 = !{!525, !339, i64 12}
!558 = !DILocation(line: 120, column: 25, scope: !417, inlinedAt: !486)
!559 = !DILocation(line: 121, column: 32, scope: !417, inlinedAt: !486)
!560 = !{!525, !340, i64 9}
!561 = !DILocation(line: 122, column: 34, scope: !417, inlinedAt: !486)
!562 = !{!525, !340, i64 8}
!563 = !DILocation(line: 124, column: 34, scope: !417, inlinedAt: !486)
!564 = !{!525, !340, i64 1}
!565 = !DILocation(line: 124, column: 46, scope: !417, inlinedAt: !486)
!566 = !DILocation(line: 124, column: 26, scope: !417, inlinedAt: !486)
!567 = !DILocation(line: 125, column: 40, scope: !417, inlinedAt: !486)
!568 = !DILocation(line: 126, column: 31, scope: !417, inlinedAt: !486)
!569 = !{!525, !393, i64 2}
!570 = !DILocation(line: 128, column: 13, scope: !571, inlinedAt: !486)
!571 = distinct !DILexicalBlock(scope: !417, file: !3, line: 128, column: 13)
!572 = !DILocation(line: 128, column: 13, scope: !417, inlinedAt: !486)
!573 = !DILocation(line: 131, column: 42, scope: !417, inlinedAt: !486)
!574 = !DILocation(line: 131, column: 17, scope: !417, inlinedAt: !486)
!575 = !DILocation(line: 131, column: 9, scope: !417, inlinedAt: !486)
!576 = !DILocation(line: 132, column: 46, scope: !417, inlinedAt: !486)
!577 = !DILocation(line: 132, column: 21, scope: !417, inlinedAt: !486)
!578 = !DILocation(line: 134, column: 15, scope: !417, inlinedAt: !486)
!579 = !DILocation(line: 135, column: 21, scope: !417, inlinedAt: !486)
!580 = !DILocation(line: 136, column: 17, scope: !581, inlinedAt: !486)
!581 = distinct !DILexicalBlock(scope: !417, file: !3, line: 136, column: 13)
!582 = !DILocation(line: 136, column: 23, scope: !581, inlinedAt: !486)
!583 = !DILocation(line: 136, column: 21, scope: !581, inlinedAt: !486)
!584 = !DILocation(line: 136, column: 32, scope: !581, inlinedAt: !486)
!585 = !DILocation(line: 136, column: 40, scope: !581, inlinedAt: !486)
!586 = !DILocation(line: 136, column: 46, scope: !581, inlinedAt: !486)
!587 = !DILocation(line: 136, column: 44, scope: !581, inlinedAt: !486)
!588 = !DILocation(line: 136, column: 13, scope: !417, inlinedAt: !486)
!589 = !DILocation(line: 139, column: 14, scope: !417, inlinedAt: !486)
!590 = !DILocation(line: 139, column: 22, scope: !417, inlinedAt: !486)
!591 = !{!592, !393, i64 12}
!592 = !{!"ethhdr", !340, i64 0, !340, i64 6, !393, i64 12}
!593 = !DILocation(line: 140, column: 17, scope: !417, inlinedAt: !486)
!594 = !{i64 0, i64 1, !492, i64 0, i64 1, !492, i64 1, i64 3, !492, i64 4, i64 2, !392, i64 6, i64 1, !492, i64 7, i64 1, !492, i64 8, i64 16, !492, i64 8, i64 16, !492, i64 8, i64 16, !492, i64 24, i64 16, !492, i64 24, i64 16, !492, i64 24, i64 16, !492}
!595 = !{i64 0, i64 3, !492, i64 3, i64 2, !392, i64 5, i64 1, !492, i64 6, i64 1, !492, i64 7, i64 16, !492, i64 7, i64 16, !492, i64 7, i64 16, !492, i64 23, i64 16, !492, i64 23, i64 16, !492, i64 23, i64 16, !492}
!596 = !{i64 0, i64 2, !392, i64 2, i64 1, !492, i64 3, i64 1, !492, i64 4, i64 16, !492, i64 4, i64 16, !492, i64 4, i64 16, !492, i64 20, i64 16, !492, i64 20, i64 16, !492, i64 20, i64 16, !492}
!597 = !{i64 0, i64 1, !492, i64 1, i64 1, !492, i64 2, i64 16, !492, i64 2, i64 16, !492, i64 2, i64 16, !492, i64 18, i64 16, !492, i64 18, i64 16, !492, i64 18, i64 16, !492}
!598 = !{i64 0, i64 1, !492, i64 1, i64 16, !492, i64 1, i64 16, !492, i64 1, i64 16, !492, i64 17, i64 16, !492, i64 17, i64 16, !492, i64 17, i64 16, !492}
!599 = !{i64 0, i64 16, !492, i64 0, i64 16, !492, i64 0, i64 16, !492, i64 16, i64 16, !492, i64 16, i64 16, !492, i64 16, i64 16, !492}
!600 = !{i64 0, i64 4, !492, i64 0, i64 4, !492, i64 0, i64 4, !492, i64 4, i64 16, !492, i64 4, i64 16, !492, i64 4, i64 16, !492}
!601 = !DILocation(line: 142, column: 39, scope: !417, inlinedAt: !486)
!602 = !{!338, !339, i64 40}
!603 = !DILocation(line: 142, column: 15, scope: !417, inlinedAt: !486)
!604 = !DILocation(line: 142, column: 9, scope: !417, inlinedAt: !486)
!605 = !DILocation(line: 143, column: 1, scope: !417, inlinedAt: !486)
!606 = !DILocation(line: 145, column: 1, scope: !417, inlinedAt: !486)
!607 = !DILocation(line: 376, column: 3, scope: !414)
!608 = !DILocation(line: 377, column: 20, scope: !609)
!609 = distinct !DILexicalBlock(scope: !414, file: !3, line: 377, column: 11)
!610 = !DILocation(line: 377, column: 45, scope: !609)
!611 = !DILocalVariable(name: "skb", arg: 1, scope: !612, file: !3, line: 248, type: !147)
!612 = distinct !DISubprogram(name: "nat64_handle_v6", scope: !3, file: !3, line: 248, type: !418, scopeLine: 249, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !613)
!613 = !{!611, !614, !615, !616, !617, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !647, !654, !661, !668, !677, !679, !682}
!614 = !DILocalVariable(name: "nh", arg: 2, scope: !612, file: !3, line: 248, type: !353)
!615 = !DILocalVariable(name: "data_end", scope: !612, file: !3, line: 250, type: !17)
!616 = !DILocalVariable(name: "data", scope: !612, file: !3, line: 251, type: !17)
!617 = !DILocalVariable(name: "saddr_key", scope: !612, file: !3, line: 253, type: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v6_trie_key", file: !34, line: 20, size: 160, elements: !619)
!619 = !{!620, !626}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !618, file: !34, line: 21, baseType: !621, size: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_lpm_trie_key", file: !6, line: 74, size: 32, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !621, file: !6, line: 75, baseType: !22, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !6, line: 76, baseType: !625, offset: 32)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, elements: !122)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !618, file: !34, line: 22, baseType: !37, size: 128, offset: 32)
!627 = !DILocalVariable(name: "dst_v6", scope: !612, file: !3, line: 254, type: !73)
!628 = !DILocalVariable(name: "subnet_v6", scope: !612, file: !3, line: 254, type: !37)
!629 = !DILocalVariable(name: "allowval", scope: !612, file: !3, line: 255, type: !89)
!630 = !DILocalVariable(name: "src_v4", scope: !612, file: !3, line: 255, type: !22)
!631 = !DILocalVariable(name: "dst_v4", scope: !612, file: !3, line: 255, type: !22)
!632 = !DILocalVariable(name: "ip_type", scope: !612, file: !3, line: 256, type: !69)
!633 = !DILocalVariable(name: "ip_offset", scope: !612, file: !3, line: 256, type: !69)
!634 = !DILocalVariable(name: "ip6h", scope: !612, file: !3, line: 257, type: !430)
!635 = !DILocalVariable(name: "ret", scope: !612, file: !3, line: 258, type: !69)
!636 = !DILocalVariable(name: "eth", scope: !612, file: !3, line: 259, type: !324)
!637 = !DILocalVariable(name: "iph", scope: !612, file: !3, line: 260, type: !447)
!638 = !DILocalVariable(name: "v6_state", scope: !612, file: !3, line: 262, type: !75)
!639 = !DILocalVariable(name: "dst_hdr", scope: !612, file: !3, line: 264, type: !448)
!640 = !DILocalVariable(name: "____fmt", scope: !641, file: !3, line: 281, type: !644)
!641 = distinct !DILexicalBlock(scope: !642, file: !3, line: 281, column: 17)
!642 = distinct !DILexicalBlock(scope: !643, file: !3, line: 280, column: 56)
!643 = distinct !DILexicalBlock(scope: !612, file: !3, line: 280, column: 13)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 480, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 60)
!647 = !DILocalVariable(name: "____fmt", scope: !648, file: !3, line: 294, type: !651)
!648 = distinct !DILexicalBlock(scope: !649, file: !3, line: 294, column: 17)
!649 = distinct !DILexicalBlock(scope: !650, file: !3, line: 293, column: 39)
!650 = distinct !DILexicalBlock(scope: !612, file: !3, line: 293, column: 13)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 440, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 55)
!654 = !DILocalVariable(name: "____fmt", scope: !655, file: !3, line: 304, type: !658)
!655 = distinct !DILexicalBlock(scope: !656, file: !3, line: 304, column: 17)
!656 = distinct !DILexicalBlock(scope: !657, file: !3, line: 303, column: 72)
!657 = distinct !DILexicalBlock(scope: !612, file: !3, line: 301, column: 13)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 416, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 52)
!661 = !DILocalVariable(name: "____fmt", scope: !662, file: !3, line: 312, type: !665)
!662 = distinct !DILexicalBlock(scope: !663, file: !3, line: 312, column: 17)
!663 = distinct !DILexicalBlock(scope: !664, file: !3, line: 311, column: 24)
!664 = distinct !DILexicalBlock(scope: !612, file: !3, line: 311, column: 13)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 344, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 43)
!668 = !DILocalVariable(name: "____fmt", scope: !669, file: !3, line: 320, type: !674)
!669 = distinct !DILexicalBlock(scope: !670, file: !3, line: 320, column: 25)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 319, column: 32)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 319, column: 21)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 317, column: 24)
!673 = distinct !DILexicalBlock(scope: !612, file: !3, line: 317, column: 13)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 408, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 51)
!677 = !DILocalVariable(name: "____fmt", scope: !678, file: !3, line: 325, type: !674)
!678 = distinct !DILexicalBlock(scope: !672, file: !3, line: 325, column: 17)
!679 = !DILocalVariable(name: "____fmt", scope: !680, file: !3, line: 332, type: !674)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 332, column: 17)
!681 = distinct !DILexicalBlock(scope: !673, file: !3, line: 327, column: 16)
!682 = !DILabel(scope: !612, name: "out", file: !3, line: 361)
!683 = !DILocation(line: 0, scope: !612, inlinedAt: !684)
!684 = distinct !DILocation(line: 378, column: 10, scope: !609)
!685 = !DILocation(line: 253, column: 2, scope: !612, inlinedAt: !684)
!686 = !DILocation(line: 253, column: 21, scope: !612, inlinedAt: !684)
!687 = !DILocation(line: 254, column: 9, scope: !612, inlinedAt: !684)
!688 = !DILocation(line: 254, column: 34, scope: !612, inlinedAt: !684)
!689 = !DILocation(line: 255, column: 9, scope: !612, inlinedAt: !684)
!690 = !DILocation(line: 264, column: 2, scope: !612, inlinedAt: !684)
!691 = !DILocation(line: 264, column: 15, scope: !612, inlinedAt: !684)
!692 = !DILocation(line: 270, column: 30, scope: !612, inlinedAt: !684)
!693 = !DILocation(line: 270, column: 21, scope: !612, inlinedAt: !684)
!694 = !DILocalVariable(name: "nh", arg: 1, scope: !695, file: !320, line: 174, type: !353)
!695 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !320, file: !320, line: 174, type: !696, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !699)
!696 = !DISubroutineType(types: !697)
!697 = !{!69, !353, !17, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!699 = !{!694, !700, !701, !702}
!700 = !DILocalVariable(name: "data_end", arg: 2, scope: !695, file: !320, line: 175, type: !17)
!701 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !695, file: !320, line: 176, type: !698)
!702 = !DILocalVariable(name: "ip6h", scope: !695, file: !320, line: 178, type: !430)
!703 = !DILocation(line: 0, scope: !695, inlinedAt: !704)
!704 = distinct !DILocation(line: 272, column: 19, scope: !612, inlinedAt: !684)
!705 = !DILocation(line: 184, column: 11, scope: !706, inlinedAt: !704)
!706 = distinct !DILexicalBlock(scope: !695, file: !320, line: 184, column: 6)
!707 = !DILocation(line: 184, column: 15, scope: !706, inlinedAt: !704)
!708 = !DILocation(line: 184, column: 6, scope: !695, inlinedAt: !704)
!709 = !DILocation(line: 187, column: 12, scope: !710, inlinedAt: !704)
!710 = distinct !DILexicalBlock(scope: !695, file: !320, line: 187, column: 6)
!711 = !DILocation(line: 187, column: 20, scope: !710, inlinedAt: !704)
!712 = !DILocation(line: 187, column: 6, scope: !695, inlinedAt: !704)
!713 = !DILocation(line: 193, column: 44, scope: !695, inlinedAt: !704)
!714 = !{!715, !340, i64 6}
!715 = !{!"ipv6hdr", !340, i64 0, !340, i64 0, !340, i64 1, !393, i64 4, !340, i64 6, !340, i64 7, !532, i64 8, !532, i64 24}
!716 = !DILocalVariable(name: "nh", arg: 1, scope: !717, file: !320, line: 139, type: !353)
!717 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !320, file: !320, line: 139, type: !718, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{!69, !353, !17, !45}
!720 = !{!716, !721, !722, !723, !725}
!721 = !DILocalVariable(name: "data_end", arg: 2, scope: !717, file: !320, line: 140, type: !17)
!722 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !717, file: !320, line: 141, type: !45)
!723 = !DILocalVariable(name: "i", scope: !724, file: !320, line: 143, type: !69)
!724 = distinct !DILexicalBlock(scope: !717, file: !320, line: 143, column: 2)
!725 = !DILocalVariable(name: "hdr", scope: !726, file: !320, line: 144, type: !728)
!726 = distinct !DILexicalBlock(scope: !727, file: !320, line: 143, column: 47)
!727 = distinct !DILexicalBlock(scope: !724, file: !320, line: 143, column: 2)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !432, line: 62, size: 16, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !729, file: !432, line: 63, baseType: !45, size: 8)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !729, file: !432, line: 64, baseType: !45, size: 8, offset: 8)
!733 = !DILocation(line: 0, scope: !717, inlinedAt: !734)
!734 = distinct !DILocation(line: 193, column: 9, scope: !695, inlinedAt: !704)
!735 = !DILocation(line: 0, scope: !724, inlinedAt: !734)
!736 = !DILocation(line: 0, scope: !726, inlinedAt: !734)
!737 = !DILocation(line: 146, column: 11, scope: !738, inlinedAt: !734)
!738 = distinct !DILexicalBlock(scope: !726, file: !320, line: 146, column: 7)
!739 = !DILocation(line: 146, column: 15, scope: !738, inlinedAt: !734)
!740 = !DILocation(line: 146, column: 7, scope: !726, inlinedAt: !734)
!741 = !DILocation(line: 149, column: 3, scope: !726, inlinedAt: !734)
!742 = !DILocation(line: 160, column: 4, scope: !743, inlinedAt: !734)
!743 = distinct !DILexicalBlock(scope: !726, file: !320, line: 149, column: 26)
!744 = !DILocation(line: 0, scope: !743, inlinedAt: !734)
!745 = !{!746, !340, i64 1}
!746 = !{!"ipv6_opt_hdr", !340, i64 0, !340, i64 1}
!747 = !{!746, !340, i64 0}
!748 = !DILocation(line: 156, column: 4, scope: !743, inlinedAt: !734)
!749 = !DILocation(line: 276, column: 25, scope: !612, inlinedAt: !684)
!750 = !DILocation(line: 277, column: 21, scope: !612, inlinedAt: !684)
!751 = !DILocation(line: 279, column: 9, scope: !612, inlinedAt: !684)
!752 = !DILocation(line: 279, column: 32, scope: !612, inlinedAt: !684)
!753 = !DILocalVariable(name: "a", arg: 1, scope: !754, file: !3, line: 228, type: !73)
!754 = distinct !DISubprogram(name: "cmp_v6addr", scope: !3, file: !3, line: 228, type: !755, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{!69, !73, !73}
!757 = !{!753, !758, !759}
!758 = !DILocalVariable(name: "b", arg: 2, scope: !754, file: !3, line: 228, type: !73)
!759 = !DILocalVariable(name: "i", scope: !754, file: !3, line: 230, type: !69)
!760 = !DILocation(line: 0, scope: !754, inlinedAt: !761)
!761 = distinct !DILocation(line: 280, column: 13, scope: !643, inlinedAt: !684)
!762 = !DILocation(line: 232, column: 21, scope: !763, inlinedAt: !761)
!763 = distinct !DILexicalBlock(scope: !764, file: !3, line: 232, column: 21)
!764 = distinct !DILexicalBlock(scope: !765, file: !3, line: 231, column: 33)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 231, column: 9)
!766 = distinct !DILexicalBlock(scope: !754, file: !3, line: 231, column: 9)
!767 = !DILocation(line: 232, column: 39, scope: !763, inlinedAt: !761)
!768 = !DILocation(line: 232, column: 21, scope: !764, inlinedAt: !761)
!769 = !DILocation(line: 281, column: 17, scope: !641, inlinedAt: !684)
!770 = !DILocation(line: 281, column: 17, scope: !642, inlinedAt: !684)
!771 = !DILocation(line: 283, column: 17, scope: !642, inlinedAt: !684)
!772 = !DILocation(line: 293, column: 30, scope: !650, inlinedAt: !684)
!773 = !DILocation(line: 293, column: 21, scope: !650, inlinedAt: !684)
!774 = !DILocation(line: 293, column: 13, scope: !612, inlinedAt: !684)
!775 = !DILocation(line: 294, column: 17, scope: !648, inlinedAt: !684)
!776 = !DILocation(line: 294, column: 17, scope: !649, inlinedAt: !684)
!777 = !DILocation(line: 296, column: 17, scope: !649, inlinedAt: !684)
!778 = !DILocation(line: 300, column: 18, scope: !612, inlinedAt: !684)
!779 = !DILocation(line: 300, column: 16, scope: !612, inlinedAt: !684)
!780 = !DILocation(line: 301, column: 14, scope: !657, inlinedAt: !684)
!781 = !DILocation(line: 301, column: 21, scope: !657, inlinedAt: !684)
!782 = !DILocation(line: 304, column: 17, scope: !655, inlinedAt: !684)
!783 = !DILocation(line: 304, column: 17, scope: !656, inlinedAt: !684)
!784 = !DILocation(line: 306, column: 17, scope: !656, inlinedAt: !684)
!785 = !DILocation(line: 309, column: 19, scope: !612, inlinedAt: !684)
!786 = !DILocation(line: 309, column: 32, scope: !612, inlinedAt: !684)
